cf/Documents/Обращение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Обращение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетОбработка1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
						<v8:Type>cfg:CatalogRef.Функции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВнешниеОтчетыИОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВнешняяОбработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Функции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/КатегорииОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КатегорииОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВнешнихОтчётовИОбработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурацииБезПодтвержденияОдобрения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Обращение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ФормироватьЗадание Экспорт;

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		//ПользовательИнициатор = ТИ.ПолучитьПользователяПоФизЛицу(Инициатор.ФизЛицо, Инициатор._Логин, "Пользователь");
		//ПользовательОтветственный = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, Ответственный._Логин, "Сотрудник");
		
		ПользовательИнициатор = ТИ.ПолучитьПользователяПоФизЛицу(Инициатор.ФизЛицо, "Пользователь");
		ПользовательОтветственный = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, "Сотрудник");
		
		Если ПользовательИнициатор = Неопределено ИЛИ ПользовательОтветственный = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		//СтрокаHTML = "";
		//ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		//"СтандартныеПодсистемы.БизнесПроцессыИЗадачи\ПриОпределенииПредставленияПредметаВнешнейЗадачи");
		//Для каждого Обработчик Из ОбработчикиСобытия Цикл
		//	Обработчик.Модуль.ПриОпределенииПредставленияПредметаВнешнейЗадачи(Ссылка, СтрокаHTML);
		//КонецЦикла;
		//СодержаниеПредмета = Новый ХранилищеЗначения(СтрокаHTML, Новый СжатиеДанных());
		
		Если ФормироватьЗадание Тогда
			
			БП = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
			БП.Дата = ТекущаяДата();
			БП.Автор = ПользовательОтветственный;
			БП.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
			БП.Выполнено = Ложь;
			БП.Исполнитель = ПользовательОтветственный;
			БП.Наименование = "Тестирование внешней обработки";
			
			//		БП.НаПроверке = Истина;
			БП.НаПроверке = ТИ.ВыполнятьСогласование() И ВыполнятьСогласование;
			
			БП.Подтверждено = Ложь;
			БП.Предмет = Ссылка;
			БП.Проверяющий = ПользовательИнициатор;
			БП.Содержание = "Тестирование внешней обработки";
			БП.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен;
			//		БП.СрокИсполнения = ТекущаяДата()+ 86400*7;
			//		БП.АвторСтрокой = ПользовательОтветственный.Наименование;
			БП.ВнешнееЗадание = Ложь;
			//		БП.СодержаниеПредмета = СодержаниеПредмета;
			БП.Записать();
			БП.Старт();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьЗадачи = НЕ РезультатЗапроса.Пустой();
	
	ФормироватьЗадание = (ЭтоНовый() ИЛИ НЕ ЕстьЗадачи) И Категория = Перечисления.КатегорииОбращений.ИзменениеВнешнихОтчётовИОбработок;
	Если ЭтоНовый() Тогда 
		Пользователь = ТИ.ПолучитьПользователяПоФизЛицу(Ответственный.ФизЛицо, "Сотрудник");
		Конфигурация = Пользователь.ОсновнаяКонфигурация;
		ВыполнятьСогласование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
